import os

print("""
\x1b[38;2;255;20;147m╭━━┳━╮╱╭┳━━━┳━━━━┳━━━┳╮╱╱╭╮
\x1b[38;2;255;20;147m╰┫┣┫┃╰╮┃┃╭━╮┃╭╮╭╮┃╭━╮┃┃╱╱┃┃
\x1b[38;2;255;20;147m╱┃┃┃╭╮╰╯┃╰━━╋╯┃┃╰┫┃╱┃┃┃╱╱┃┃
\x1b[38;2;255;20;147m╱┃┃┃┃╰╮┃┣━━╮┃╱┃┃╱┃╰━╯┃┃╱╭┫┃╱╭╮
\x1b[38;2;255;20;147m╭┫┣┫┃╱┃┃┃╰━╯┃╱┃┃╱┃╭━╮┃╰━╯┃╰━╯┃
\x1b[38;2;255;20;147m╰━━┻╯╱╰━┻━━━╯╱╰╯╱╰╯╱╰┻━━━┻━━━╯
""")
print("""Choose 1 if you downloaded Labotomy from tg and 2 if from github""")
print("---------------------------------------------------------")
print("""Выбирай 1 если скачал Labotomy с тг и 2 если с github""")
print("---------------------------------------------------------")
print("""[1] Telegram\n[2] Github""")

c = input(">>>: ")
if c == "1":
    os.system("pip install unzip")
    os.system("unzip Labotomy-3.0.0-S.zip")
    os.chdir('Labotomy')
    os.system("pip install -r requirements.txt")
    os.system('clear')
    print("""
\x1b[38;2;255;20;147m╭━━┳━╮╱╭┳━━━┳━━━━┳━━━┳╮╱╱╭╮
\x1b[38;2;255;20;147m╰┫┣┫┃╰╮┃┃╭━╮┃╭╮╭╮┃╭━╮┃┃╱╱┃┃
\x1b[38;2;255;20;147m╱┃┃┃╭╮╰╯┃╰━━╋╯┃┃╰┫┃╱┃┃┃╱╱┃┃
\x1b[38;2;255;20;147m╱┃┃┃┃╰╮┃┣━━╮┃╱┃┃╱┃╰━╯┃┃╱╭┫┃╱╭╮
\x1b[38;2;255;20;147m╭┫┣┫┃╱┃┃┃╰━╯┃╱┃┃╱┃╭━╮┃╰━╯┃╰━╯┃
\x1b[38;2;255;20;147m╰━━┻╯╱╰━┻━━━╯╱╰╯╱╰╯╱╰┻━━━┻━━━╯
""")
    print("Установка завершена. Перейдите в папку 'Labotomy' с помощью команды ---> cd Labotomy и запустите файл python Labotomy.py")
    
elif c == "2":
    os.system("pip install unzip")
    os.system("unzip Labotomy-3.0.0-G.zip")
    os.system("pip install -r requirements.txt")
    os.system('clear')
    print("""
\x1b[38;2;255;20;147m╭━━┳━╮╱╭┳━━━┳━━━━┳━━━┳╮╱╱╭╮
\x1b[38;2;255;20;147m╰┫┣┫┃╰╮┃┃╭━╮┃╭╮╭╮┃╭━╮┃┃╱╱┃┃
\x1b[38;2;255;20;147m╱┃┃┃╭╮╰╯┃╰━━╋╯┃┃╰┫┃╱┃┃┃╱╱┃┃
\x1b[38;2;255;20;147m╱┃┃┃┃╰╮┃┣━━╮┃╱┃┃╱┃╰━╯┃┃╱╭┫┃╱╭╮
\x1b[38;2;255;20;147m╭┫┣┫┃╱┃┃┃╰━╯┃╱┃┃╱┃╭━╮┃╰━╯┃╰━╯┃
\x1b[38;2;255;20;147m╰━━┻╯╱╰━┻━━━╯╱╰╯╱╰╯╱╰┻━━━┻━━━╯
""")
    print("Установка завершена. Запустите файл 'Labotomy.py' с помощью команды ---> python Labotomy.py")